# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа.
# n — кол-во элементов первого множества.
# m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.
# Решение
n=int(input('Введите количество элементов в n: '))
m=int(input('Введите количество элементов в m: '))
n_list=[]
for i in range(n):
    x = int(input('Введите элемент списка n: '))
    n_list.append(x)
n_set = set(n_list)
m_list=[]
for i in range(m):
    y = int(input('Введите элемент списка m: '))
    m_list.append(y)
m_set = set(m_list)
s_set = sorted(n_set.intersection(m_set))
print(n_list)
print(m_list)
print(s_set)




#Задача 24: В фермерском хозяйстве в Карелии выращивают чернику.
#Она растет на круглой грядке, причем кусты высажены только по окружности.
#Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
#Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод – на i- ом кусте
#выросло ai ягод. В этом фермерском хозяйстве внедрена система автоматического сбора черники.
#Эта система состоит из управляющего модуля нескольких собирающих модулей. Собирающий модуль за один заход, находясь
#непосредственно перед кустом, собирает ягоды с этого куста и с двух соседних с ним.
#Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль,
#находясь перед некоторым кустом заданной во входном файле грядки.
№Решение
n_bushes = int(input('Введите количество кустов черники: '))
list_1 = list()
for i in range(n_bushes):
    a =int(input('Введите количество ягод на кусте: '))
    list_1.append(a)

list_1_count = list()
for i in range(len(list_1)):
       list_1_count.append(list_1[i-2] + list_1[i-1] + list_1[i]) #Хождение по списку по 3 соседним значениям и суммирование
print(max(list_1_count))