Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх
# решкой, а некоторые – гербом. Определите минимальное число
# монеток, которые нужно перевернуть, чтобы все монетки были
# повернуты вверх одной и той же стороной. Выведите минимальное
# количество монет, которые нужно перевернуть.
# Решение
a = int(input('Введите количество монеток: '))
c = 0
for i in range(a):
    v = int(input('Введите  1, если решко; Введите 0 если орел: '))
    if v == 1:
        c += 1
if c<a/2:
    print(f'Нуэно перевернуть монет: {c} ')
else:
    print(f'Нуэно перевернуть монет: {a-c} ')


Задача 12: 
#Петя и Катя – брат и сестра. Петя – студент, а Катя –
#школьница. Петя помогает Кате по математике. Он задумывает два
#натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
#этого Петя делает две подсказки. Он называет сумму этих чисел S и их
#произведение P. Помогите Кате отгадать задуманные Петей числа.
#РЕШЕНИЕ
sum = int(input('Введите сумму чисел: '))
p = int(input('Введите произведение чисел: '))
x = (sum-int((sum**2-4*p)**0.5))//2
y = sum - x
if x>1000 and y>1000:
     print('Петя обманул Катю')
print(f'числа задуманные Петей{x, y}')


Задача 14:
#Требуется вывести все целые степени двойки (т.е. числавида 2k), не превосходящие числа N.
#РЕШЕНИЕ: 
n = int(input('Введите целое число больше 1: '))
count=1
while count<=n:
    print(count, end=' ')
    count=count*2

